ryantrue/deos/firmware/esp32p4/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# A 720x720 software-rendered LVGL surface is not viable with the IDF debug
# default (-Og): a single refresh can starve CPU1's idle task for seconds.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# DEOS uses A/B OTA slots. With blank otadata and no factory partition,
# ESP-IDF boots ota_0 on the first USB flash.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Waveshare ESP32-P4-WIFI6-Touch-LCD-4B rev1.x memory profile.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_SPEED=200
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=4096
CONFIG_CACHE_L2_CACHE_128KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# MIPI DSI/DMA2D and 200 MHz PSRAM support on ESP32-P4.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# LVGL 9.5.
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
# Run software drawing in a FreeRTOS-backed worker. With LV_OS_NONE, LVGL's
# draw dispatcher busy-waits and can starve an idle task during a large frame.
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_USE_FREERTOS_TASK_NOTIFY=y
CONFIG_LV_DRAW_THREAD_STACK_SIZE=8192
CONFIG_LV_DRAW_THREAD_PRIO=2

# ESP32-C6 Wi-Fi coprocessor over the board's 4-bit SDIO link.
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=54
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
# The SDIO transport pool needs roughly 47 KiB. Keep scarce internal DMA RAM
# available for the display and allocate the ESP-Hosted pool from P4 PSRAM.
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
CONFIG_ESP_WIFI_REMOTE_ENABLED=y

# ESP-Hosted recommends a 1 kHz FreeRTOS tick to avoid SDIO bus jitter.
CONFIG_FREERTOS_HZ=1000

# Keep serial logs on the CH343P UART used by this Waveshare board.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# HTTPS trust store for temporary GitHub dev OTA.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
